{
  "_name_or_path": "roberta-base",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "intro",
    "1": "thanks",
    "2": "counter-price",
    "3": "vague-price",
    "4": "init-price",
    "5": "inform",
    "6": "insist",
    "7": "disagree",
    "8": "agree",
    "9": "supplemental",
    "10": "unknown",
    "11": "inquire"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "agree": 8,
    "counter-price": 2,
    "disagree": 7,
    "inform": 5,
    "init-price": 4,
    "inquire": 11,
    "insist": 6,
    "intro": 0,
    "supplemental": 9,
    "thanks": 1,
    "unknown": 10,
    "vague-price": 3
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.31.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
